/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   put_char.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kchaozu <kchaozu@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/07 15:14:22 by kchaozu           #+#    #+#             */
/*   Updated: 2019/12/07 15:14:25 by kchaozu          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

/*
** Обработка и вывод модификатора преобразования СИМВОЛ.
**
** Возврат: ссылка на конец буфера, NULL если добавление символа
** окончилось неудачно.
*/

char	*put_char(char c)
{
	if (!c)
		g_conv.prefix = NULL;
	if (!buff_addchar(c, 1))
		return (NULL);
	return (g_buff.ptr);
}
