/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   switch_exp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kchaozu <kchaozu@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/07 15:47:15 by kchaozu           #+#    #+#             */
/*   Updated: 2019/12/07 15:52:46 by kchaozu          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

/*
** Обработка значения модификатора преобразования ЭКПОНЕНТА.
**
** Возврат: ссылка на буфер, NULL в случае неудачи записи в буфер.
*/

char	*switch_exp(void)
{
	if (g_conv.modifier == 40)
		return (put_ldexp(va_arg(g_argslist, long double)));
	return (put_ldexp(va_arg(g_argslist, double)));
}
